RIET/src/ExchangePlans/Leg7/Leg7.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="1b51ab19-fe58-4529-9962-96b0eb7270f6">
  <name>Leg7</name>
  <attributes>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертироватьВСтандартныеЕдиницыИзмерения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АрхивироватьФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияРазмеров</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТолькоИмпортныеПарсели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьLEвТрипах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalInfoReport</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Leg6Report</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольЗаполненностиNetWeight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьФайлВОтчетеОбОшибках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменятьСкладUNKN</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаСкладаUNKN</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйСоставРедактируемыхПолейLeg6</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьПроверкуСоставаИмпортныхПарселей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportReports</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДатыНачалаВыгрузкиДокументовПоСкладам</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаВыгрузкиДокументов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключаемыеБрокеры</name>
    <attributes>
      <name>Agent</name>
      <type>
        <types>CatalogRef.Agents</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ProcessLevels</name>
    <attributes>
      <name>ProcessLevel</name>
      <type>
        <types>CatalogRef.ProcessLevels</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

RIET/src/ExchangePlans/Leg7/Forms/ФормаУзла/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСписокВыбораДляСклада();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаЕдиницыИзмерения.Видимость = Объект.КонвертироватьВСтандартныеЕдиницыИзмерения;
	УстановитьВидимостьЭлементовAdditionalInfo(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовAdditionalInfo(Форма, Объект)
	
	Элементы = Форма.Элементы;
	ИспользованиеAdditionalInfoReport  = Объект.AdditionalInfoReport;
	
	Элементы.ЗаменятьСкладUNKN.Видимость = ИспользованиеAdditionalInfoReport;
	Элементы.ЗаменаСкладаUNKN.Видимость = ИспользованиеAdditionalInfoReport И Объект.ЗаменятьСкладUNKN;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьСписокВыбораДляСклада()

	Элементы.ДатыНачалаВыгрузкиДокументовПоСкладамСклад.СписокВыбора.ЗагрузитьЗначения(Объект.ServiceProvider.Warehouses.ВыгрузитьКолонку("Warehouse"));

КонецПроцедуры

&НаКлиенте
Процедура ServiceProviderПриИзменении(Элемент)
	
	УстановитьСписокВыбораДляСклада();
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьВСтандартныеЕдиницыИзмеренияПриИзменении(Элемент)
	Если Не Объект.КонвертироватьВСтандартныеЕдиницыИзмерения Тогда
		Объект.ЕдиницаИзмеренияВеса = ПредопределенноеЗначение("Справочник.UOMs.ПустаяСсылка");
		Объект.ЕдиницаИзмеренияРазмеров = ПредопределенноеЗначение("Справочник.UOMs.ПустаяСсылка");
		Элементы.ГруппаЕдиницыИзмерения.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЕдиницыИзмерения.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура AdditionalInfoReportПриИзменении(Элемент)
	УстановитьВидимостьЭлементовAdditionalInfo(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменятьСкладUNKNПриИзменении(Элемент)
	УстановитьВидимостьЭлементовAdditionalInfo(ЭтаФорма, Объект);
КонецПроцедуры
